In [ ]:

# two major libraries in python for data analysis are: Pandas & Numpy (numerical python)

Numpy handles mostly numeric values in data analysis for python
Pandas handles the data manipulation in datasets.

the two data structures in pandas are: series (one dimensional array) and data frames(multidimensionl dataset).

import numpy as np and import pandas as pd are Aliases

DataFrame is specified as "df". df using pandas turns a dictionary to a table.

In [ ]:
N.B; Anytime you use for, else, if, def the next line must be indented
     nothing should written on the same line with "def"

In [1]:
x=[1,2,3,4]

In [3]:
import numpy as np

In [6]:
ar= np.array(x)

In [15]:
ar

array([1, 2, 3, 4])

In [16]:
import pandas as pd

In [18]:
series= pd.Series(ar)

In [19]:
series

0    1
1    2
2    3
3    4
dtype: int32

In [1]:
dict={'name': ['peter','mary','john','ben'],
      'age': [30,25,35,40],
      'marital status': ['s','s','m','m'],
      'salary': [10000,20000,30000,40000]}

In [2]:
import numpy as np
import pandas as pd

df= pd.DataFrame(dict)
df

    name  age marital status  salary
0  peter   30              s   10000
1   mary   25              s   20000
2   john   35              m   30000
3    ben   40              m   40000

In [3]:
# to check the information in a dataset (table)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            4 non-null      object
 1   age             4 non-null      int64
 2   marital status  4 non-null      object
 3   salary          4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [4]:
# object is the same thing as sting. Therefore, string in python is object in panda

In [5]:
# to display all the columns in a dataset

df.columns

Index(['name', 'age', 'marital status', 'salary'], dtype='object')

In [6]:
# to display(check) the shape (no. of columns and rows) of a dataset

df.shape

(4, 4)

In [7]:
# to display(check) for null values

df.isnull().sum()

name              0
age               0
marital status    0
salary            0
dtype: int64

In [8]:
df.isna().sum()

name              0
age               0
marital status    0
salary            0
dtype: int64

In [9]:
# the result above, shows that there is no missing data in the dataset

#python does no allow spaces between words

In [10]:
#                                How to rename a column

In [11]:
# how to call a column

#df['age'] or df.age   (ALWAYS GO WITH THE FIRST ONE)

In [12]:
#                                How to rename a column

In [13]:
df=df.rename({'age':'age_limit'}, axis='columns')

In [14]:
df

    name  age_limit marital status  salary
0  peter         30              s   10000
1   mary         25              s   20000
2   john         35              m   30000
3    ben         40              m   40000

In [26]:
#                           How to replace a value

In [27]:
dict1= {'name': ['peter','mary','john','ben'],
      'age': [30,25,35,'40"'],
      'marital status': ['s','s','m','m'],
      'salary': [10000,20000,30000,40000]}

In [28]:
# to display your dictionary in a table

df1= pd.DataFrame(dict1)

In [29]:
df1

    name  age marital status  salary
0  peter   30              s   10000
1   mary   25              s   20000
2   john   35              m   30000
3    ben  40"              m   40000

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            4 non-null      object
 1   age             4 non-null      object
 2   marital status  4 non-null      object
 3   salary          4 non-null      int64
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [31]:
# to take way the column in age (affected column)

df1=df1.replace({'"':''}, regex=True)

In [32]:
df1

    name age marital status  salary
0  peter  30              s   10000
1   mary  25              s   20000
2   john  35              m   30000
3    ben  40              m   40000

In [33]:
# 'regex' means regular expression

In [34]:
# To change the age column(or the affected column) to integer

df1['age']= pd.to_numeric(df1['age'])

In [35]:
df1

    name  age marital status  salary
0  peter   30              s   10000
1   mary   25              s   20000
2   john   35              m   30000
3    ben   40              m   40000

In [37]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            4 non-null      object
 1   age             4 non-null      int64
 2   marital status  4 non-null      object
 3   salary          4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [ ]:
# Adding a new column and cleaning the dates in data

In [38]:
dict3= {'name': ['peter','mary','john','ben'],
        'date_of_birth':['27/09/1980', '01/10/1977','30/01/1965','15/03/1997'],
      'marital status': ['s','s','m','m'],
      'salary': [10000,20000,30000,40000]}

In [39]:
df3= pd.DataFrame(dict3)

In [40]:
df3

    name date_of_birth marital status  salary
0  peter    27/09/1980              s   10000
1   mary    01/10/1977              s   20000
2   john    30/01/1965              m   30000
3    ben    15/03/1997              m   40000

In [41]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            4 non-null      object
 1   date_of_birth   4 non-null      object
 2   marital status  4 non-null      object
 3   salary          4 non-null      int64
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [42]:
import datetime

In [44]:
# to convert the column from object to datetime

df3['date_of_birth']=pd.to_datetime(df3['date_of_birth'])

In [45]:
df3

    name date_of_birth marital status  salary
0  peter    1980-09-27              s   10000
1   mary    1977-01-10              s   20000
2   john    1965-01-30              m   30000
3    ben    1997-03-15              m   40000

In [46]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            4 non-null      object
 1   date_of_birth   4 non-null      datetime64[ns]
 2   marital status  4 non-null      object
 3   salary          4 non-null      int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 256.0+ bytes

In [ ]:
# Sepration of the date of birth into year, month and date

N.B: dt means datetime (datatype)

In [50]:
df3['day']=df3['date_of_birth'].dt.day
df3['month']=df3['date_of_birth'].dt.month
df3['year']=df3['date_of_birth'].dt.year

In [51]:
df3

    name date_of_birth marital status  salary  day  month  year
0  peter    1980-09-27              s   10000   27      9  1980
1   mary    1977-01-10              s   20000   10      1  1977
2   john    1965-01-30              m   30000   30      1  1965
3    ben    1997-03-15              m   40000   15      3  1997